import 'package:kazakh/hive/model.dart';

List<ThemeModel> initialData = [
  ...List.generate(
      _titles.length,
      (index) => ThemeModel(translate: _translates[index])
        ..text = _textes[index]
        ..title = _titles[index])
];

List<String> _titles = [
  'Компьютерлiк моделдеу',
  '«Ақпараттық жүйелер» мамандығы',
  'Ғаламтор',
  'Есептеуіш техниканың даму тарихы',
  'Программалық құралдар',
  'Математикалық және компьтерлік модельдеу'
      'Мәліметтер қоры',
  'Есептеу жүйесінің құрамы',
  'Телекоммуникациялар',
  'Компьютерлік желілері туралы түсінік, оның тағайындалуы',
];

List<String> _textes = [
  '''Модель дегеніміз - нақты объектіні, процессті немесе құбылысты ықшам әрі шағын түрде бейнелеп көрсету.
Модельдеу– объектілерді, процесстерді немесе құбылыстарды зерттеу мақсатында олардың моделін (макетін) құру. 
Модель– көрнекі түрде жазбаша жоспар, сызба ретінде жасалуы мүмкін. 
Модельдер көрсетілуіне қарай екі үлкен топқа бөлінеді – материалдық және ақпарттық. Материалдық модельді заттық немесе физикалық деп айтуға болады. Олар түпнұсқаның геометриялық немесе физикалық қасиеттерін көрсетеді. Материалдық модельге мысал ретінде қарапайым балалардың ойыншығын алуға болады. Олардың көмегімен балалар қоршаған орта жөнінде түсінік алады.
Ал ақпараттық модель деп объектінің, процестің, құбылыстың қасиеттері мен күйін және сыртқы әлеммен өзара байланысын сипаттайтын ақпараттар жиынтығын айтамыз. 
Компьютерлік модельдеу ақпараттық модельдеудің бір түрі болып табылады. Адам құрылатын модельдің бейнесін алдын-ала ойлағаннан соң оны іске асыруға ыңғайлы программалық құралдардың көмегіне жүгінеді. Яғни компьютерлік модель деп программалық орта көмегімен жүзеге асатын модельдерді айтамыз. Ал модельдеуді компьютерлік бағдарламалар көмегімен жүзеге асыруды – компьютерлік модельдеу деп атауға болады. Мысалы геометриялық модель (сурет, сызба т. б.) құру үшін – графикалық редакторлар, сөзбен сипатталатын модель үшін мәтіндік редактор, кестелік модельдер үшін электрондық кестелер немесе деректер базасын басқару жүйелері қолданылуы мүмкін. Кейде объектінің немесе процестің математикалық моделі құрылып оны ары қарай компьютерді зерттеу арнайы программалау тілдерінің көмегімен жүзеге асырылады.
Жаңа конструкторлық жұмыс, техникалық шешімдерді өндірісте пайдалану және жаңа идеяларды тексеру үшін эксперимент жасау қажет. Зертханалық және табиғи эксперименттер көп уақыт және материалдық шығынды қажет етеді. Есептеу техникасының дамуына байланысты зерттеудің жаңа әдісі компьютерлік тәжірибеге жол ашылды. Комьютерлік тәжірибе жүргізу кезінде объектінің комьютерлік моделі құрылады және ол компьютерде арнайы тестілеуден өтеді. Тестілеу – модельдің дұрыстығын тексеру. Егер нәтиже ойдағыдай болмаса, модельдеу процессі қайта басынан басталуы мүмкін. ''',
  '''«Ақпараттық жүйелер» кафедрасының тарихы 1992 жылдан басталады,  Қостанай педогогикалық институты базасында А. Байтұрсынов атындағы Қостанай мемлекеттік университетінің құрылуымен байланысты «Қолданбалы математика» кафедрасы құрылды.
Кафедраның алғашқы менгерушісі болып 1992 жылы жұмыс тәжірибесі мол, информатика облысындағы маман, доцент Гевейлер Геннадий  Николаевич тағайындалды.
1992 жылдан бастап кафедра экономикалық батыттағы, қолданбалы математика квалификациясымен «Қолданбалы математика» мамандығы бойынша мамандарды шығарды. Ал 2001 жылдан бастап кафедра экономикадағы ақпараттық жүйелер мамандығы бойынша мамандарды шығара бастады. 
Қазіргі уақытта Ақпараттық жүйелер және информатика кафедрасы екі білім беру бағдарламасы бойынша бакалаврларды дайындауда.
Ақпараттық жүйелер білім беру бағдарламасы екі бағыт бойынша білім ұсынады: 
- телекоммуникация және байланыс жүйелері бойынша ақпараттық жүйелер
- менеджменттегі ақпараттық жүйелер.
 Ақпараттық жүйелердің бакалавры әртүрлі технологиялардың байланыс жүйелерінің техникалық және бағдарламалық қолдауын және қызмет көрсету деңгейлерін, сонымен қатар экономикадағы ақпараттық жүйелерін, инфо – коммуникациялық желілерін, Интернет желілерін қамтамасыздандырады.
Біздің түлектерді телекоммуникациялық компанияларда, консалтингтік және компьютерлік фирмаларда, жарнамалық және басылым компанияларында, банктік және сақтандыру компанияларында, кедең және салық аумағында, қаржылық, мемлекеттік мекемелерде, Қазақстанның және Қостанай облысының үлкен өндірістік мекемелерінде, жергілікті әкімшілік жүйелерінде кездестіруге болады. 
Кафедра санында 28 шығарылым, біздің түлектердің мансабы мен қызмет атқару жоағрафиясы оқытушылар мен университет үшін үлкен мақтаныш. 500 астам жоғары квалификацияланған мамандар Қазақстанда, Ресейде, Германия, США және басқа да елдерде жұмыс істейді. Түлектердің ішінен атап өту керек: Қазақстан Республикасының шахмат бойынша екімәрте чемпион атағына иеленген Костенко Петрді, ССГПО инженер – программисті Панченко Анатолийді, Жумагулов Ерланды «Алгоритм - Сервис» фирмасында директордың орынбасары және т.б.
''',
  ''' Ғаламтор - адамзаттың ақпараттық технология саласындағы жеткен жетістіктерінің бірі. Біртұтас ақпараттық кеңестік ғаламтор деп аталады. Ғаламтор- бүкіл жер шары бойынша ақпарат тарататын желілер жиынтығы. Ғаламтор- компьютерлік желілердің ішіндегі көп қолданылатыны. 
Оны пайдаланушылардың саны ай сайын шамамен 1 миллионға өсіп отыр. Интернеттің ерекшелігі- онда ақпараттар сақталады. Компьютерді ғаламторға қосқанда тұтынушыға электрондық пошта ашылады. 
Бұл электрондық пошта хабарды әлемнің кез келген нүктесіне бірнеше сағатта жедел жеткізеді. Кәдімгі поштаға қарағанда өте жылдам және қызмет құны да арзан. Біз электрондық поштадағы хабарды нақты бір адамға оның электрондық пошта адресін көрсете отырып жөнелтеміз. 
Гипермәтіндік сілтемені пайдаланып, интернетті бірінен келесіге көшіріп  беруге болады.
Ғаламтор - ғылым мен техниканың шынайы жетістігі. Интернетті қолдана алатын кез келген адам өзіне қалаған ақпарат мен мағлұматты тауып, қажетіне жарата алады. Мазалап жүрген сауалдарының жауабын табады. Әлемдік жаңалықтар мен оқиғалардан хабардар болып отыруға көмектеспек. Бұл жағынан интернет адамның білімі мен қабілетін, тұлғалық қасиеттерін дамытуға ықпал етеді.
Ғаламторда шек жоқ. Алыста жүрген ата-анаңмен де, туған-туыстарыңмен де емін-еркін байланыс ұстайсың, сөйлесесіз, хабарласасың. Тіпті, адамдардың қолы жетпейтін жерге осы ғаламтордың қолы тиіп тұр. Көрісе алмаған адамыңмен ғаламтор арқылы байланыс орнатасың. 
Ғаламдық желі, сөзсіз, адамның білімін жетілдіруге көмектесетін құрал. Соның арқасында шет тілін үйреніп, түрлі курстар мен тренингтерге қатысуға болады. Одан бөлек, ғаламтор - нағыз табыс көзіне айналып отырған сала. Онымен табыс тауып отырғандар да аз емес.
''',
  '''Есептеу құрылғылары пайда болмай тұрып, адамдар әр түрлі есептеуді жүргізу мүмкіндіктерін іздеді:
Бұл үшін олар қол саусақтарын, тастарды, ағаш таяқшаларды пайдаланды. 
Олар тастарды үйіп немесе қатарлап санап есептеулер жүргізді. 
Заттардың аны жерге сызған сызықшалар мен, ағаш таяқшаларды жасалған кертіктермен немесе жіптерге түйілген түйіншектермен есептелді.
Ең ерте замаңғы және бәрімізге белгілі есептеу құралы есепшот болып табылады. Есепшоттың пайда болған уақытың осы кезге дейін ешкім айта алмайды. Деректерге қарағанда есепшоттың жасы 2000-5000 жылдар шамасында, ал пайда болған жері ертедегі Қытай немесе ертедегі Египет , тіпті ежелгі Греция болуы да мүмкін. Бұл санау құралын Гректермен Батыс Еуропалықтар «абак», Қытайлықтар «суанпан», Жапондықтар «серобян», ал Ресейде «есепшот» деп атаған.
1642 жылы француз математигі Блез Паскаль он тоғыз жасында дүние жүзінде бірінші рет қосу машинасы деп атпен белгілі, жетектер мен дөңгелектерден тұратын механикалық  есептеу машинасын құрастырды.
1694 жылы атақты неміс математигі Лейбниц Паскалдың идеясы дамытып , өзінің механикалық есептеу машинасын арифометрді құрастырды. Дөңгелектің орнында мұнда цифрлар жазылған цилиндр қолданылды. Арифмометр қазір оқушының қолында жүретін калькулятордың негізін салды. 
Алғашқы есептеуіш автоматтың авторы Ч. Бэббидж еді, сондықтан оны  көптеген адамдар қазіргі компьтердің атасы деп атайды.  1833 жылы ол бағдарлама арқылы басқарыллатын  «Аналитикалық машина»жобасын жасады. Дүние жүзі бойынша  алғашқы 1846 жылы Ч. Бэббидж машинасына бағдарлама жазған Ада Лавлейс бағдарламаушы деп саналады.
«Марк-I» (1944). Құрастырушы  – Говард Айкен (1900-1973). АҚШ-тағы алғашқы автоматты компьютер: ұзындығы 17 м, салмағы 5 тонна, 75 000 электронды шам, 3000 механикалық реле, көбейту – 3 секунд, бөлу – 12 секунд.
	''',
  ''' Программа — магниттік тасымалдаушыда (дискіде) файл түрінде сақталып, әрбір адамның командасы бойынша компьютер жадына жүктеліп, орындауға арналған машина тіліндегі нүсқаулар жиыны.
Интерфейс - программалық жабдықпен жұмыс істейтін адам арасындағы сұқбат жүргізу шарттары мен келісімдер жиыны.
Программалық жасақ – ақпараттық технологиялардың елеулі бір бөлігі. Программасыз кез келген аппаратура жәй элементгер жиыны болады да, ол ешнәрсе істей алмайды.
ЭЕМ программалары екі топқа бөлінеді, олар:
1)  жүйелі программалық жасақ; 2)  қолданбалы программалық жасақ.
Жүйелі программалар ЭЕМ-нің аппараттық жабдықтар жұмысын басқарып, жүмыс істеп отырған адамды қолданбалы программалармен байланыстырады.
Жүйелі программалық жасақты бірнеше топқа жіктеуге болады:
1)  операциялық жүйелер; 2)  утилиттер; 3)  сервистік программалар.
Операциялық жүйелер - компьютерді басқаруға арналған және қолданбалы программалармен байланысы бар нақты программа. Дербес компьютерлер үшін кең тараган операциялық жүйелерге МSDOS, Windows , Windows NT,OS/2, UNIX жатады. Сервистік программалар — әрбір адамның операциялық жүйемен жұмыс істеуін жеңілдететін программалар тобы.
Қолданбалы программалар арқылы біздер өз есептерді шығарамыз. Мұндай программалар "қосымшалар" деп аталады. Қолданбалы программалар сан алуан, оларға қарапайым программадан бастап күрделі есептерді шығара алатын қуатты мамандандырылған жүйелерді, ғылыми мәселелерге арналған және жалпы көпшілікке қызмет ету кешендерін де жатқызуға болады: - мәтін редакторлары; - графикалық редакторлар; - электрондык, кестелер; -  оқыту жоне ойнау программалары және т.б.
Ойын программалары дербес ЭЕМ-дердегі қызғылықты, кез келген жан әуестенетін топқа жатады. 
Оқыту программалары оқу-үйрену сабақтарын ұйымдастырады, олардың мектепте не үйде әр-түрлі пәндерден сабаққа дайындалу кезінде өте ыңғайлы. 
Іс программалары қызметте керекті әртүрлі ақпараттарды дайындау, сақтау және өндеу үшін кеңінен қолданылып жүр.
Қазіргі кезде жасалынып жатқан программалар теледидар, тоңазытқыш, шаңсорғыш тәрізді өндірістік өнімдер санатына кіреді. Бұл программаларды жасау мен тарату — өндірісті жүргізу зандылықтарымен бірдей деңгейде болады деген сөз.
Бүл күндері тегін берілетін, шартты түрде (жартылай) тегін және сатылатын программалар бар. Программаларды сатып алу және таралу шарттары сол программамен бірге берілетін оның сатушысы не авторы дайындаган құжаттарда жазылады. Біреудің программасын пайдалану үшін осыңдай мәселелерге көңіл бөліп отыру қажет екенін естен шығармаған жөн.
''',
  ''' Математикалық және компьтерлік модельдеу
Модель (лат. modulus – үлгі) дегеніміз – нақты обьектіні, процесті немесе құбылысты ықшам әрі шағын түрде бейнелеп көрсету.
Модельдеу – объектілерді, процестерді немесе құбылыстарды зерттеу мақсатында олардың модельдерін (макеттерін) құру.
Модель көрнекі түрде жазбаша жоспар, сызба ретінде жасалуы мүмкін. 
Математикалық модель дегеніміз - объектінің қызметі мен құрылымын сипаттайтын математикалық тәуелділіктер жүйесі, яғни математикалық формулалар мен тендеулер арқылы өрнектелетін объектілердің математикалық сипаттамалары.
Компьютерлік модель деп программалық орта көмегімен іске асатын модельдерді айтады.
Модельдердің ролінде әр түрлі объектілерді алуға болады: бейнелеулер, схемалар, карталар, графикалар, компьютерлік бағдарламалар, математикалық формулалар және т. б.
Егер біз математикалық формулалармен нақты объектіні ауыстырсақ оны математикалық модельдеу деп атайды, сол сияқты егер нақты объектілерді компьютерлік бағдарламамен алмастырсақ – оны компютерлік модельдеу деп атайды. 
Қазіргі кезде компьютерлік модельдеу әртүрлі салаларда зерттеулер жүргізу үшін қолданылады: 1) ядролық реакцияларды есептеу; 2) астрономия, космонавтика есептерін шешу; 3) ауа райы мен климатты модельдеу, экологиялық мәселелерді зерттеу, ғаламдық жылу нәтижелерін болжау; 4) технологиялық үрдістерді модельдеу; 5) химиялық және биологиялық үрдістерді есептеу; 6) әлеуметтік зерттеулер жүргізу: сайлау нәтижелерін болжау, қоғамдық пікірдің өзгеруі, әскери әрекеттерді модельдеу; 7) әлемдегі, белгілі бір мемлекеттегі демографиялық жағдайды есептеу және болжамдау; 8) әртүрлі техникалық және электронды құралдардың жұмыс істеуін модельдеу; 9) кәсіпорындардың, салалардың, мемлекеттің экономикалық дамуын зерттеу және т.б.
Компьютерлік модельді құру бірнеше кезеңнен тұрады: 
•	Формализация, яғни объектінің математикалық моделін құру; 
•	ЭЕМ-де есептеулер жүргізу;
•	программаны құрастыру, оны жақсарту;
•	нәтиже алу.''',
  '''
Мәліметтер қоры дегеніміз ақпаратты сақтауға және жинақтауға арналған ұйымдасқан құрылым. Ең алғаш мәліметтер қоры ұғымы жаңадан қалыптасқан кезде онда шындығында мәліметтер сақталатын. Бірақ қазіргі кездегі көптеген мәліметтер қоры басқару жүйелері өздерінің құрылымдарында тек мәліметтерді ғана емес, сонымен қатар олардың тұтынушымен және басқа да ақпараттық – программалық кешендермен қарым – қатынасының әдістерін де қамтиды. Сондықтан біз қазіргі заманғы мәліметтер қорында тек мәліметтер ғана емес, ақпараттар да сақтай аламыз.
Көп мәліметтер жұмыс жасау қажеттілігі пайда болғанда әрқашанда мәліметтер қорын пайдаланды.
Мәліметтер қоры – бұл ең алдымен кестелер жиынтығы, алайда, біз соңынан мәліметтер қорына сондай – ақ процедуралармен бірқатар басқа объектілер жатуы мүмкін екенін көреміз. Кестені көптеген объектілердің сипаттамалары бар кәдімгі екі өлшемді кесте түрінде көруге болады. Кестенің идентификатор аты болады.
Кесте бағандары объектілердің қандайда бір сипаттамаларына – алаңдарға сәйкес. Әрбір алаң сақталатын мәліметтердің атымен және түрімен сипатталады. Алаң аты – бұл мәліметтермен пайдалану үшін, әртүрлі программаларда қолданылатын идентификатор. Ол кез келген идентификатор сияқты латын әріптерімен жазылады, бір сөзден тұрады және т.б.
Алаң түрі алаңда сақталатын мәліметтердің түрін сипаттайды. Бұл жолдар, сандар, үлкен мәтіндер (мысалы, қызметкерлердің мінездемелері), суреттер (қызметкерлердің суреттері) және т.с.с. болуы мүмкін.
Кестенің әрбір жолы объектілердің біреуіне сәйкес келеді. Ол жазба деп аталады және осы объектіні сипаттайтын барлық алаңдардың мазмұнын құрайды.
Мәліметтер қорының кестелерін құрған кезде ақпараттың қарама – қайшылықсыздығын қамтамасыз ету маңызды. Әдетте бұл негізгі алаңдарды енгізумен жасалады. Негізгі болып бір немесе бірнеше алаң болуы мүмкін.
Кестемен жұмыс кезінде пайдаланушы немесе программа жазбалар үстінен курсормен жылжып отыратын сияқты. Әрбір уақыт сәтінде ағымдағы жазба бар, содан жұмыс жүргізіледі. Мәліметтер қорының кестелерінде жазбалар қандай да бір тәртіпсіз, оларды енгізу (жаңа қызметкерлердің пайда болуы) ретіне қарай орналасуы мүмкін. Бірақ кесте мәліметтері пайдаланушыға ұсынылған кезде реттелуі керек. Пайдаланушы оларды алфавиттік тәртіпке, немесе бөлімдер бойынша реттелген, немесе туған жылының өсуіне қарай және т.б. қарауы мүмкін. Мәліметтерді реттеу үшін индекс түсінігі қолданылады. Индекс кестені қандай реттілікте қараған жөн екенін көрсетеді. Ол пайдаланушы мен кесте арасында делдал болып табылады 
''',
  '''Есептеу жүйесінің құрамын оның конфигурациясы деп атайды. Есептеу жүйесінің аппараттық және программалық құралдары әрқайсысы өз алдына жеке қарастырылатындықтан, сәйкесінше есептеу жүйесінің аппараттық конфигурациясы мен программалық конфигурациясы да жеке жеке қарастырылады.
   Ақпараттық жасақтамаға есептеу техникасының аппараттық конфигурациясының құрайтын құрылғылары жатады. Қазіргі заманғы компьютерлер мен есептеу кешендері блокты модульді құрылымнан тұрады, яғни олар нақты бір жұмыс түрін атқаруға ыңғайландырылып дайын түйіндер мен блоктардан жиыстырылатындай аппараттық конфигурациядан тұрады.
   Орталық процессорға қатысты алған құрылғылар ішкі және сыртқы болып екіге бөлінеді. Енгізу шығару құрылғыларының көбі және ақпаратты ұзақ уақыт сақтауға арналған құрылғылар сыртқы құрылғыларға жатады.
   Жеке түйіндер мен блоктар арасындағы үндестік ақпараттық интерфейс деп аталатын аппараттық логикалық құрылғылардың көмегімен орындалады. Есептеу техникасындағы аппараттық интерфейс стандарттары хаттама деп аталады.
   Программалық жасақтама. Программа деп реттелген командалар тізбегін айтады. Кез келген компьютерлік программаның негізгі атқаратын қызметі аппараттық құралдарды басқару. Аппараттық және программалық жасақтама үнемі өзара тығыз байланыста болады.
   Программалық жасақтама бірнеше сатылардан тұрады: негізгі, жүйелік, қызметтік және қолданбалы. Негізгі программалық жасақтама аппараттық құралдармен өзара байланыста болады.
   Ұйымдастырумен жасақтау ақпараттық жүйенің тиімді жұмыс істеуі үшін қажет. Бұл дегеніміз, нақты обьектіні басқарудағы экономикалық негізге сүйенген шешімдердің сапасын және жеделдігін арттыру үшін экономика математикалық әдістер мен үлгілерді, қазіргі заманғы есептеу техникасын, жаңа ақпараттық технологияларды қолдану өте маңызды екенін білдіреді. Жалпы ұйымдастырумен жабдықтаудың мақсаты, жүйені тұрғызу мен әрі қарайғы қолданудың ұйымдастыру құқықтық негізін қалыптастыру. Оған ақпараттық жүйенің функционалдық және жабдықтау бөлімдерінің ұтымды құрылымын таңдау мен дайындауды, сондай ақ жобалау жұмыстарының жүргізілуін, оның ендірілуін, таңдауды анықтайтын әдістер мен жабдықтар және құжаттар жатады. Белгілі ережелерге бағындыру құжаттары ақпараттықжүйені тұрғызудың, жұмыс істеу мен модернизациялаудың барлық деңгейлерінде мемлекеттік басқару ұйымдары және тапсырма беруші мен жұмысты орындаушы арасындағы өзара қатынасты белгілі ережелерге бағындыратын құжат түрінде болып бөлінеді.
   Техникалық жабдықтау бұл ақпараттық жүйемен жұмыс істеуде қолданылатын техникалық жабдықтар жиынтығы. Басқарудағы ақпараттық кезең жеке амалдардың, олардың жиынтығының орындалуы арқылы жүзеге асады. Барлық амалдарды үш сатыға топтауға болады: ақпаратты алу, оны түрлендіру және тұтыну.
Бірінші саты экономикалық обьектілердегі қызмет барысында туындайтын бастапқы ақпаратта жинауды және тіркеуді орындайтын бастапқы ақпаратты жинауды және тіркеуді орындайтын амалдар тобын қамтиды. Бұл амалдың мақсаты мекемелердің, кәсңпорындардың және басқалардың қызметін бейнелейтін ақпарат алу.
Екінші саты ақпаратты түрлендіру амалының тобы, кеңістік және уақыт бойынша мәндердің, түрлердің, құрылымдардың өзгеруін орындайды.
Үшінші саты амалдар тобын және олардың басқарушылық шешімдерді қабылдау үшін, әрі басқарудың ақпараттық кезеңдерін жалғастыру үшін ақпаратты тұтынудағы маңызын білу.
''',
  '''Телекоммуникациялар – бұл қашықтық бойынша қарым-қатынас жасау сұрақтарымен айналысатын технологиялары. 1 суретте телекоммуникациялардың түрлері көрсетілген.
Телекоммуникациялар екі түрге бөлінеді: бірбағытты және екі бағытты. Бірбағытта жұмыс жасау – бұл ақпаратты орталықтан абонеттерге тарату – радиохабарлау, телехабарлау. Екібағытты екі абонент арасында қарым-қатынасты орнатады.
Телекоммуникацияларда механикалық және электрлік құралдар қолданылады. Олардың шығу тарихы механикалық түрінен бастап электрлік түріне дейін күрделі элекрлік схемаларды қолдануға дейін дамыған. Дәстүрлі операторлар - ұлттық пошта, телеграфтық және телефондық компаниялары телекоммуникациялардың екі түрін қолданады.
Суреттің жоғары жағында көрсетілген электрлік телекоммуникацияларды – электрбайланыс деп аталады. Кәдімгі пошта мен баспасөз сияқты механикалық телекоммуникациялардың бөлігі уақыт өткен соң азып бастады, ал электрлік телекоммуникациялардың бөлігі өсіп барады.
Суреттің шетінде біріншіден механикалық телекоммуникациялар көрсетілген: пошта, баспасөз. Содан кейін электрлік: телеграф, телекс (абоненттік телеграф), телефон, радио, телеарна, компьютерлік желілер, белгіленген желілер, кабельді телеарна және мобильді телефон. Инфокоммуникациялық қызметтерді екіге бөлуге болады - негізгі (basic services) және қосымша (supplememoru services) қызметтер. Инфокоммуникациялық қызметтердің  түрлері үш терминалды пайдаланады: телефон, компьютер және теледидар. Терминалдардың сондай тіркесі мультимедиа қызметтерді жасауға мүмкіндік береді. 
Мультимедиа қызметтер интерактивті режимді қамтамасыздандырады, және хабарламаның екі немесе үш түрдің (сөздерді, белгілерді (деректерді), суреттерді) берілісін ұсынылады. Деректер бұл ЭЕМ – де өңдеу немесе ЭЕМ-нен алынған хабарламалар. 
Желіде пайдаланушыларға қызмет көрсетуды телеақпараттық қызметтер қамтамасыздандырады. Телеақпараттық қызметтер телеқызметтерге және беріліс қызметтерге бөлінеді.
Беріліс қызметтер немесе ақпаратты жеткізу қызметтері телекоммуникациялық желімен қамтамасыздандырады, телекоммуникациялық желі бұл - алыс орналасқан объектілердің арақатынасын қамтамасыздандыратын техникалық құралдар жыинтығы.
Телеқызметтер негізгі төрт топқа бөлінеді: интерактивті, хабарлама жіберу қызметтері, ақпараттық және телехабарлау қызметтері. 
''',
  '''Желі дегеніміз ресурстарды – дискілерді, принтерлерді ортақ пайдалану мақсатында бір-бірімен мәлімет алмасу арналарымен байланысқан бірнеше компьютерлер тобы.
Бірнеше (екіден артық) компьютерлерді бір-бірімен физикалық түрде байланыстырғанда компьютерлік желі құрылады. Жалпы компьютерлік желі құру үшін арнаулы аппараттық жабдықтама (желілік жабдықтар) және арнаулы программалық жабдықтама (желілік программалық құралдар) қажет болады. Мәлімет алмасу үшін компьютерлерді қарапайым түрде бір-бірімен байланыстыру түрі тікелей байланыс деп аталады. Компьютерлік желілерді құру кезінде шешілетін негізгі мәселе – аппараттық жабдықтардың электрлік және механикалық сипаттамалары мен ақпараттық жабдықтамалардың (программалық мәліметтердің) форматтары мен кодталу жүйелерінің бір-біріне сәйкес келіп үйлесуін қамтамасыз ету болып табылады. Соңғы мәліметтер үйлесімін жүзеге асыру үшін оларды стандарттау мақсатында OSI (Model of Open System Interconnections – ашық жүйелердің өзара әрекеттесу моделі) моделі жасалып шықты. Бұл модель Халықаралық стандарттар жасау ұйымының – ISO (International Standards Organization) техникалық ұсыныстары негізінде құрылған еді.
Пайдаланылатын хаттамаларға байланысты компьютерлік желілер жергілікті (LAN – Local Area Network) және ауқымды (WAN – Wide Area Network) деп екіге бөлінеді.
Жергілікті желі – бір мекеменің ғимараты көлеміндегі немесе жақын орналасқан ғимараттарда орналасқан компьютерлер желісі. Олардың бірі көбінесе орталық сервер (басты компьютер) рөлін атқарады. Жергілікті компьютерлік желіге қосылған әртүрлі ЭЕМ-дердің дискілеріндегі бумалар мен файлдарда орналасқан мәліметті пайдалану өз компьютеріңде орналасқан мәліметті пайдалануға өте ұқсас болып келеді. 
Ауқымды (ғаламдық) желілер бүкіл дүние жүзіндегі компьютерлерді немесе олардың тораптарын байланыстыруға арналған желілер түрі, олар көбінесе ғарыштық (спутниктік) байланыс арналарын пайдаланады.

Интернеттің теориялық негіздері
Компьютер арқылы мәлімет тасымалдау тәжірибелері 1950 жылдары басталып, ол әуелгі кезде лабораториялық эксперимент түрінде қарастырылған еді. Содан оншақты жылдар өткен соң, АҚШ қорғаныс министрлігінің Перспективалық Жұмыстар Агенттігі (DARPA – Defense Advanced Research Project Agency) қаржысына мемлекеттік деңгейдегі алғашқы компьютерлік желі жасалып шықты. Агенттіктің атына байланысты ол ARPANET деп аталды. ARPANET желісі 1969 жылы жұмыс істей бастады. Осы желі жаңа компьютерлер тораптарының (түйіндерінің) қосылуына қарай кеңітіліп, 80 жылдарда ірілендірілген тораптар негізінде аймақтық желілер жасалып, ARPANET жүйесі жалпы архитектурасының төменгі деңгейлері іске қосыла бастады. Интернеттің нақты дүниеге келуі 1983 жыл болып саналады. Дүниежүзілік желі негізін құрайтын, бүгінге дейін кең пайдаланылып келе жатқан TCP/IP байланыс хаттамасының сол стандартталған мерзімі Интернеттің бастау алған күні болып табылады.
TCP хаттамасы. TCP(transfer control protocol) хаттамасына сәйкес жөнелтілетін мәліметтер шағын пакеттерге (дестелерге) бөлінеді де, олардың әрқайсысы белгілі бір тәртіппен таңбаланады. Бұлай таңбалау тәсілі мәліметтерді керекті компьютерге жеткізгеннен кейін қайтадан біріктіруге мүмкіндік береді.
IP хаттамасы. IP (Internet Protocol) адрестік хаттама болып табылады. Оған сәйкес Дүниежүзілік желіге қосылған әрбір компьютердің өзіндік ерекше адресі (IP-адрес) болуы тиіс. Осы адреске қарай TCP пакеттері керекті компьютерге тез жеткізіледі. Адрес нүктемен бөлінген төрт саннан тұрады. Соларға байланысты желі тораптары арасында қажетті байланыс орнатылады да, мәлімет “жақын” немесе “алыс” орналасқан бір компьютерге жөнелтіледі. Бұл тырнақшадағы сөздер ара қашықтықты емес, мәліметті жылдам жеткізуге болатын нүктелер мүмкіндігін көрсетеді. Қай компьютердің “жақын” немесе “алыс” екендігін арнайы құралдар – маршрутизаторлар анықтайды.
Интернеттегі қызмет түрлері
Интернетте қызмет түрлері (баптары) өте көп, олардың әрқайсысының өз хаттамасы болады. Олар қолданбалы хаттамалар деп аталады. Қолданбалы хаттамаларға сәйкес мәлімет алмасу арнайы клиенттік программалар (немесе жай клиент) арқылы орындалады.
Электрондық пошта (E-Mail). Бұл жұмыспен Интернетте арнайы пошта серверлері айналысады. Сервер рөлін компьютер немесе арнайы программалық жабдықтама атқарады. 
World Wide Web – бұл Web-серверлерде сақталатын, өзара байланыстағы миллиондаған электрондық құжаттардан тұратын біртұтас информациялық кеңістік. Web кеңістігін құрайтын жеке құжаттардың бір беті Web-парақ деп аталады. Белгілі бір тақырып бойынша біріктірілген Web-парақтар жиыны Web-тораптарды немесе Web-сайттарды құрайды. Web-парақтарды көруге арналған программалар броузерлар болып аталады. 
''',
];

List<String> _translates = [
  '''Модель - это компактное и небольшое изображение определенного объекта, процесса или явления.
Моделирование - создание модели (макета) объектов, процессов или явлений с целью их изучения.
Модель - это визуально написанный план, который можно нарисовать.
В зависимости от презентации модели делятся на две основные группы - материальные и информационные. Материальную модель можно назвать материальной или физической. Они отражают геометрические или физические свойства оригинала. Примером материальной модели является обычная детская игрушка. С их помощью дети получают представление об окружающей среде.
Информационная модель - это набор информации, описывающий свойства и состояние объекта, процесса, явления и его взаимодействие с внешним миром.
Компьютерное моделирование - это разновидность информационного моделирования. Подумав об образе создаваемой модели, человек обращается к помощи программного обеспечения, которое удобно для его реализации. То есть компьютерная модель - это модель, которая реализуется с помощью программной среды. А осуществление моделирования с помощью компьютерных программ можно назвать компьютерным моделированием. Например, для создания геометрической модели (чертежа, диаграммы и т. Д.) Можно использовать графические редакторы, текстовый редактор для вербальной модели, электронные таблицы для табличных моделей или системы управления базами данных. Иногда создается математическая модель объекта или процесса, а дальнейшие компьютерные исследования проводятся с помощью специальных языков программирования.
Необходимо проводить эксперименты, проверять новые конструкторские работы, технические решения в производстве и новые идеи. Лабораторные и натурные эксперименты требуют больших временных и материальных затрат. С развитием компьютерных технологий новый метод исследования открыл путь в компьютерную практику. В ходе компьютерного эксперимента создается компьютерная модель объекта, которая специально тестируется на компьютере. Тестирование - проверка правильности модели. Если результат окажется неудачным, процесс моделирования можно будет перезапустить.''',
  '''
История кафедры «Информационные системы» восходит к 1992 году на базе Костанайского педагогического института. В связи с созданием Костанайского государственного университета имени Байтурсынова была создана кафедра прикладной математики.
В 1992 году первым заведующим кафедрой был назначен Геннадий Николаевич Хевейлер, доцент, ученый-компьютерщик с большим опытом работы.
С 1992 года на кафедре выпускаются специалисты по направлению «Прикладная математика» с квалификацией «Прикладная математика, экономика». А с 2001 года кафедра начала выпускать специалистов по информационным системам в экономике.
В настоящее время кафедра информационных систем и информатики готовит бакалавров по двум образовательным программам.
Программа обучения информационным системам дает знания в двух областях:
- информационные системы для телекоммуникаций и систем связи
- информационные системы в менеджменте.
 Бакалавр информационных систем обеспечивает техническую и программную поддержку и уровни обслуживания систем связи различных технологий, а также информационных систем в экономике, инфокоммуникационных сетей, Интернета.
Наших выпускников можно найти в телекоммуникационных компаниях, консалтинговых и компьютерных компаниях, рекламных и издательских компаниях, банковских и страховых компаниях, таможенных и налоговых органах, финансовых, государственных органах, крупных промышленных предприятиях Казахстана и Костанайской области, местных администрациях.
28 выпусков кафедры, карьеры и география карьеры наших выпускников - большая гордость преподавателей и вуза. Более 500 высококвалифицированных специалистов работают в Казахстане, России, Германии, США и других странах. Отметим, что выпускниками являются Петр Костенко, двукратный чемпион Республики Казахстан по шахматам, Анатолий Панченко, инженер-программист ССГПО, Ерлан Жумагулов, заместитель директора «Алгоритм-Сервис» и другие.
''',
  '''
Интернет - одно из достижений человечества в области информационных технологий. Единый информационный совет называется Интернетом. Интернет - это набор сетей, которые передают информацию по всему миру. Интернет - одна из наиболее широко используемых компьютерных сетей.
Количество его пользователей растет примерно на 1 миллион каждый месяц. Особенность Интернета в том, что в нем хранится информация. Когда вы подключаете свой компьютер к Интернету, клиенту отправляется электронное письмо.
Это электронное письмо доставляет сообщение мгновенно в любую точку мира в считанные часы. Очень быстро и дешевле, чем обычная почта. Мы отправляем электронное письмо конкретному человеку с указанием его адреса электронной почты.
Вы можете использовать гипертекстовую ссылку, чтобы копировать Интернет от одного к другому.
Интернет - настоящее достижение науки и техники. Любой, у кого есть доступ к Интернету, может найти и использовать необходимую информацию и информацию. Найдите ответы на свои вопросы. Помогите вам быть в курсе мировых новостей и событий. В связи с этим Интернет способствует развитию знаний и умений, личностных качеств.
Интернету нет предела. Вы сможете общаться, общаться и общаться со своими родителями и родственниками, которые находятся далеко. Фактически, Интернет недоступен. Вы общаетесь с кем-то, кого не видите в Интернете.
Глобальная сеть - это, конечно, инструмент, помогающий улучшить человеческие знания. Благодаря этому вы можете изучать иностранный язык и участвовать в различных курсах и тренингах. Кроме того, Интернет становится настоящим источником дохода. Многие зарабатывают на этом деньги.
''',
  '''
До появления вычислительных устройств люди искали разные способы выполнения вычислений:
Для этого они использовали свои пальцы, камни и деревянные палки.
Считали камни стопками или рядами.
Он рассчитывался путем рисования линий на земле, зазубрин, сделанных из деревянных палочек или узлов, связанных веревкой.
Самый ранний и самый известный инструмент расчета - счет-фактура. Никто не может сказать, когда была создана учетная запись. По имеющимся данным, возраст счета составляет около 2000-5000 лет, а происхождение его может быть в Древнем Китае или Древнем Египте и даже Древней Греции. Греки и западные европейцы называли этот калькулятор «счетами», китайский «суанпан», японский «серобян», а в России «счет».
В 1642 году, в возрасте девятнадцати лет, французский математик Блез Паскаль разработал первую в мире механическую вычислительную машину, известную как сцепная машина, состоящая из приводов и колес.
В 1694 году известный немецкий математик Лейбниц Паскаль развил эту идею и построил свою собственную арифметическую машину. Вместо колеса здесь использовали цилиндр с цифрами. Арифмометр - это основа калькулятора, который сейчас находится в руках студентов.
Автором первого компьютера был Ч. Это был Бэббидж, поэтому многие называют его дедушкой современных компьютеров. В 1833 году он создал проект «Аналитическая машина» с программным управлением. В 1846 г. Ада Лавлейс, написавшая программу для машины Бэббиджа, считается программистом.
Марк-I (1944). Составлено Ховардом Эйкеном (1900–1973). Первый автоматический компьютер в США: длина 17 м, вес 5 тонн, 75 000 электронных ламп, 3000 механических реле, умножение - 3 секунды, деление - 12 секунд.

''',
  '''
Программа - это набор инструкций машинного языка, которые хранятся в виде файла на магнитном носителе (диске), загружаются в память компьютера по команде каждого человека и выполняются.
Интерфейс - это набор условий и соглашений для собеседования с человеком, работающим с программным обеспечением.
Программное обеспечение - важная часть информационных технологий. Без программного обеспечения любое оборудование - это просто набор элементов, которые ничего не могут сделать.
Компьютерные программы делятся на две группы:
1) системное программное обеспечение; 2) прикладное программное обеспечение.
Системное программное обеспечение контролирует работу компьютерной техники и связывает работающего человека с прикладными программами.
Системное программное обеспечение можно разделить на несколько групп:
1) операционные системы; 2) коммунальные услуги; 3) сервисные программы.
Операционные системы - это специальные программы, предназначенные для управления компьютером и взаимодействия с приложениями. Наиболее распространенными операционными системами для персональных компьютеров являются MSDOS, Windows, Windows NT, OS / 2, UNIX. Служебные программы - это группа программ, облегчающих каждому работу с операционной системой.
Мы формируем наши отчеты через приложения. Такие программы называются «приложениями». Существует множество приложений, включая мощные специализированные системы, которые могут решать сложные задачи, от простых программ до научных задач и общественных служб: - текстовые редакторы; - графические редакторы; - электронные таблицы, таблицы; - тренировочные и игровые программы и др.
Игровые программы относятся к группе интересных личных увлечений на ПК.
В учебных планах организуются учебные занятия, что очень удобно при подготовке к урокам по разным предметам в школе или дома.
Деловые программы широко используются для подготовки, хранения и обработки различной информации, необходимой в службе.
В настоящее время разрабатываемые программы относятся к категории промышленных товаров, таких как телевизоры, холодильники, пылесосы. Это означает, что разработка и распространение программ будет происходить наравне с законами производства.
Сейчас есть программы, которые предоставляются бесплатно, условно (частично) бесплатно и для продажи. Условия покупки и распространения программного обеспечения изложены в документах, подготовленных поставщиком или автором, которые прилагаются к программному обеспечению. Помните, что для того, чтобы использовать чужую программу, нужно обращать внимание на такие вопросы.
''',
  '''
Математическое и компьютерное моделирование
Модель (лат. Модуль - модель) - это лаконичное и лаконичное представление определенного объекта, процесса или явления.
Моделирование - создание моделей (макетов) объектов, процессов или явлений с целью их изучения.
Модель может быть выполнена визуально в виде письменного плана, рисунка.
Математическая модель - это система математических зависимостей, которые описывают функцию и структуру объекта, то есть математические характеристики объектов, выраженные математическими формулами и уравнениями.
Компьютерная модель - это модель, которая реализуется с помощью программной среды.
В роли моделей можно брать различные объекты: изображения, схемы, карты, графики, компьютерные программы, математические формулы и т. Д. б.
Если мы заменяем реальный объект математическими формулами, это называется математическим моделированием, так же как если мы заменяем реальные объекты компьютерной программой, это называется компьютерным моделированием.
В настоящее время компьютерное моделирование используется для проведения исследований в различных областях: 1) расчет ядерных реакций; 2) решение задач астрономии, космонавтики; 3) моделирование погоды и климата, изучение проблем окружающей среды, прогнозирование результатов глобального потепления; 4) моделирование технологических процессов; 5) расчет химических и биологических процессов; 6) проведение социальных исследований: прогнозирование результатов выборов, изменение общественного мнения, моделирование военных действий; 7) расчет и прогноз демографической ситуации в мире, в конкретной стране; 8) моделирование различных технических и электронных устройств; 9) изучение экономического развития предприятий, производств, государства и др.
Создание компьютерной модели состоит из нескольких этапов:
• Формализация, т.е. создание математической модели объекта;
• Компьютерные расчеты;
• разработка программы, ее совершенствование;
• получить результат.
''',
  '''
База данных - это организованная структура для хранения и хранения информации. Когда концепция базы данных была впервые сформирована, в ней фактически хранились данные. Однако многие современные системы управления базами данных в свою структуру включают не только данные, но и способы их взаимодействия с заказчиком и другие информационные и программные системы. Таким образом, мы можем хранить не только данные, но и информацию в современной базе данных.
Он всегда использовал базу данных, когда ему нужно было работать с большим количеством данных.
База данных - это в первую очередь набор таблиц, но позже мы увидим, что база данных может также включать в себя ряд других объектов с процедурами. Таблицу можно рассматривать как обычную двухмерную таблицу с описанием многих объектов. У таблицы есть имя идентификатора.
Столбцы таблицы соответствуют определенным характеристикам объектов - площадей. Каждое поле описывается именем и типом сохраняемых данных. Имя поля - это идентификатор, используемый в различных приложениях для использования данных. Пишется латинскими буквами, как и любой идентификатор, состоит из одного слова и т. Д.
Тип поля описывает тип данных, хранящихся в поле. К ним относятся строки, числа, большие тексты (например, описания сотрудников), изображения (изображения сотрудников) и т. Д. возможно.
Каждая строка в таблице соответствует одному из объектов. Он называется записью и содержит содержимое всех полей, описывающих этот объект.
При создании таблиц базы данных важно обеспечить непротиворечивость информации. Обычно это делается путем ввода основных полей. Основным может быть один или несколько сайтов.
Когда вы работаете с таблицей, кажется, что пользователь или программа наводит курсор на записи. В каждый момент времени ведется текущая запись, а затем работа завершается. Записи в таблицах базы данных можно расположить в любом порядке, в том порядке, в котором они вводятся (появляются новые сотрудники). Однако данные таблицы должны быть скорректированы при представлении пользователю. Пользователь может отсортировать их по алфавиту, по разделам, по возрасту года рождения и т. Д. может рассмотреть. Понятие индекса используется для корректировки данных. Индекс указывает порядок, в котором следует просматривать таблицу. Это посредник между пользователем и таблицей
''',
  '''
Состав компьютерной системы называется ее конфигурацией. Поскольку аппаратное обеспечение и программное обеспечение компьютерной системы рассматриваются отдельно, конфигурация оборудования и программного обеспечения компьютерной системы рассматривается отдельно.
Информационное программное обеспечение включает устройства, составляющие аппаратную конфигурацию компьютерного оборудования. Современные компьютеры и вычислительные системы состоят из блочно-модульной структуры, то есть они имеют конфигурацию оборудования, которая может быть адаптирована для выполнения определенного типа работы и удалена из готовых узлов и блоков.
Полученные по отношению к ЦП устройства делятся на внутренние и внешние. Большинство устройств ввода-вывода и устройств для длительного хранения информации являются внешними устройствами.
Синхронизация между отдельными узлами и блоками выполняется с помощью аппаратных логических устройств, называемых информационными интерфейсами. Стандарты аппаратного интерфейса в вычислительной технике называются протоколами.
Программное обеспечение. Программа - это последовательность упорядоченных команд. Основная функция любой компьютерной программы - управление оборудованием. Аппаратное и программное обеспечение всегда в тесном контакте.
Программное обеспечение состоит из нескольких этапов: базового, системного, служебного и прикладного. Базовое программное обеспечение взаимодействует с оборудованием.
Организационная структура необходима для эффективной работы информационной системы. Это означает, что для повышения качества и эффективности экономически обоснованных решений в управлении тем или иным объектом экономики очень важно использовать математические методы и модели, современные компьютерные технологии, новые информационные технологии. Цель общего организационного оборудования - сформировать организационно-правовую основу для построения и дальнейшей эксплуатации системы. В него входят методы и оборудование, а также документы, определяющие выбор и составление рациональной структуры функционального и логистического отделов информационной системы, а также проектные работы, ее выполнение, выбор. Документы, подпадающие под определенные правила, делятся на документы в виде документов, которые регулируют взаимодействие между организациями государственного управления и заказчиком и подрядчиком на всех уровнях построения, эксплуатации и модернизации информационной системы.
Аппаратное обеспечение - это набор технических средств, используемых для работы с информационной системой. Информационная фаза в управлении осуществляется через выполнение отдельных операций, их набор. Все операции можно разделить на три этапа: получение, преобразование и потребление информации.
Первый этап включает в себя группу операций, которые собирают и фиксируют первичную информацию, которая собирается и фиксируется в исходной информации, возникающей в ходе операций на хозяйствующем субъекте. Целью такого подхода является получение информации, отражающей деятельность учреждений, предприятий и др.
Второй этап - это группа методов преобразования информации, выполнения изменения значений, типов, структур в пространстве и времени.
Третий шаг - узнать группу операций и их важность в потреблении информации для принятия управленческих решений и продолжить информационные этапы управления.
''',
  '''
Телекоммуникации - это технологии удаленного общения. На рисунке 1 показаны типы телекоммуникаций.
Телекоммуникации делятся на два типа: односторонние и двусторонние. Односторонняя работа - это передача информации от центра к абонентам - радиовещание, телетрансляция. Устанавливает двустороннюю связь между двумя абонентами.
В телекоммуникациях используются механические и электрические устройства. Их история восходит к использованию сложных электрических цепей, от механических до электрических. Традиционные операторы - национальные почтовые, телеграфные и телефонные компании - используют два типа телекоммуникаций.
Электрические телекоммуникации, показанные в верхней части рисунка, называются телекоммуникациями. Некоторые из механических телекоммуникаций, такие как обычная почта и пресса, со временем начали приходить в упадок, в то время как некоторые из электрических телекоммуникаций росли.
По краю изображения показаны первые механические средства связи: почта, пресса. Затем электричество: телеграф, телекс (абонентский телеграф), телефон, радио, телевидение, компьютерные сети, фиксированные сети, кабельное телевидение и мобильные телефоны. Инфокоммуникационные услуги можно разделить на два - базовые (базовые услуги) и дополнительные (дополнительные услуги). Виды инфокоммуникационных услуг используют три терминала: телефонный, компьютерный и телевизионный. Такое сочетание терминалов позволяет создавать мультимедийные сервисы.
Мультимедийные сервисы предоставляют интерактивный режим и предлагают два или три типа сообщений (слова, символы (данные), изображения). Данные - это компьютерная обработка или сообщения, полученные с компьютера.
Информационные услуги в Интернете предоставляются информационными службами телевидения. Телевизионные информационные услуги делятся на телевизионные услуги и услуги передачи.
Услуги передачи или услуги передачи информации предоставляются телекоммуникационной сетью, телекоммуникационная сеть - это совокупность технических средств, обеспечивающих связь между удаленными объектами.
Телевизионные услуги делятся на четыре основные группы: интерактивные, услуги обмена сообщениями, информационные и вещательные услуги.
''',
  '''
Сеть - это группа из нескольких компьютеров, связанных каналами обмена данными для обмена ресурсами - дисками, принтерами.
Когда несколько (более двух) компьютеров физически подключены друг к другу, создается компьютерная сеть. Для создания общей компьютерной сети вам потребуется специальное оборудование (сетевое оборудование) и специальное программное обеспечение (сетевое программное обеспечение). Самый простой способ соединить компьютеры друг с другом для обмена информацией - прямое общение. Основной задачей, которую предстоит решить при создании компьютерных сетей, является обеспечение совместимости электрических и механических характеристик оборудования и форматов информационного программного обеспечения (программных данных) и систем кодирования. Для стандартизации последних комбинаций данных была разработана модель OSI (Модель взаимосвязей открытых систем). Эта модель была разработана на основе технических рекомендаций Международной организации по стандартизации - ISO (International Standards Organization).
В зависимости от используемых протоколов компьютерные сети делятся на локальные (LAN - Local Area Network) и глобальные (WAN - Wide Area Network).
Локальная сеть - это сеть компьютеров, расположенных в пределах или вблизи помещений учреждения. Один из них часто выступает в роли центрального сервера (хост-компьютера). Использование информации, содержащейся в пакетах и ​​файлах на дисках различных компьютеров, подключенных к локальной компьютерной сети, очень похоже на использование информации, расположенной на вашем компьютере.
Глобальные сети - это тип сети, используемый для соединения компьютеров или их сетей по всему миру, часто с использованием спутниковых каналов связи.

Теоретические основы Интернета
Эксперименты с компьютерной передачей данных начались в 1950-х годах и первоначально рассматривались в форме лабораторных экспериментов. Спустя десятилетия первая компьютерная сеть государственного уровня была разработана на средства Агентства перспективных исследовательских проектов Министерства обороны США (DARPA). По названию агентства оно называлось ARPANET. Сеть ARPANET была запущена в 1969 году. Эта сеть была расширена за счет подключения новых компьютерных сетей (узлов), в 80-х годах были созданы региональные сети на основе агрегированных сетей, и были запущены нижние уровни общей архитектуры системы ARPANET. Настоящее рождение Интернета - 1983 год. Этим стандартизированным термином для протокола связи TCP / IP, который до сих пор составляет основу Всемирной паутины, является дата запуска Интернета.
Протокол TCP. Согласно протоколу TCP (протокол управления передачей) отправленные данные разделяются на небольшие пакеты (пакеты), каждый из которых помечается в определенном порядке. Такой способ маркировки позволяет повторно подключить данные после того, как они были доставлены на нужный компьютер.
Протокол IP. IP (Интернет-протокол) - это адресный протокол. Согласно ему, каждый компьютер, подключенный к всемирной паутине, должен иметь свой уникальный адрес (IP-адрес). В зависимости от этого адреса TCP-пакеты быстро доставляются на нужный компьютер. Адрес состоит из четырех чисел, разделенных точкой. В зависимости от них устанавливается необходимая связь между сайтами сети, и данные отправляются на компьютер, расположенный «рядом» или «далеко». Слова в этой кавычке указывают на способность точек быстро передавать информацию, а не на расстояние. Маршрутизаторы определяют, какой компьютер «ближний» или «дальний».
Типы интернет-сервисов
В Интернете существует множество типов сервисов (статей), каждая из которых имеет свой протокол. Это так называемые прикладные протоколы. Обмен данными по прикладным протоколам осуществляется через специальные клиентские программы (или простой клиент).
Электронное письмо. Эту работу выполняют специальные почтовые серверы в Интернете. В роли сервера выступает компьютер или специальное программное обеспечение.
Всемирная паутина - это единое информационное пространство, состоящее из миллионов взаимосвязанных электронных документов, хранящихся на веб-серверах. Одна страница отдельных документов, составляющих веб-пространство, называется веб-страницей. Набор веб-страниц, объединенных по определенной теме, составляет веб-сайты или веб-сайты. Программы для просмотра веб-страниц называются браузерами.
''',
];
